[{"id":11083,"date":"2021-03-17T11:17:54","date_gmt":"2021-03-17T11:17:54","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=11083"},"modified":"2021-03-17T11:17:54","modified_gmt":"2021-03-17T11:17:54","slug":"luke-greenbank-sharing-success-series","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/luke-greenbank-sharing-success-series\/","title":{"rendered":"Greenbank to inspire and share success in workshops following Manchester triumphs"},"content":{"rendered":"<p>Decorated swimmer Luke Greenbank will be aiming to inspire the next generation of backstroke swimmers in Swim England’s Sharing Success series.<\/p>\n<p>The Loughborough-based athlete, who has been <a title=\"Greenbank and Wilby set for Olympic debuts as four pre-selected for Tokyo\" href=\"https:\/\/www.swimming.org\/sport\/first-four-olympic-selections-announced\/\" target=\"_blank\" rel=\"noopener noreferrer\">pre-selected for the upcoming Tokyo Olympic Games<\/a>, is set to appear as a guest speaker on Saturday 20 March.<\/p>\n<p>Greenbank will be bringing his backstroke expertise to the session, as well as sharing personal stories which Swim England hopes will help inspire youngsters who have signed up for the workshop.<\/p>\n<!-- Start content block: sharing-success-book-btn -->\n    <style type=\"text\/css\">\n        .btn-container {\r\n    text-align: center;\r\n}\r\n.book-now-btn {\r\n  border: none;\r\n  color: white;\r\n  padding: 15px 32px;\r\n  text-align: center;\r\n  text-decoration: none;\r\n  display: inline-block;\r\n  font-size: 16px;\r\n  cursor: pointer;\r\n  background-color: #4CAF50;\r\n  margin-bottom: 15px;\r\n}\n    <\/style>\n    <div class=\"btn-container\"><a href=\"https:\/\/www.swimming.org\/sport\/sharing-success-series\/\" target=\"_self\"><button class=\"book-now-btn\">Book Here<\/button><\/a><\/div>\n<!-- End content block: sharing-success-book-btn -->\n\n<p>The <a title=\"Sharing Success Series\" href=\"https:\/\/www.swimming.org\/sport\/swimming-stars-sharing-success\/\" target=\"_blank\" rel=\"noopener noreferrer\">series of workshops<\/a> are stroke-specific and age-dependent and will focus on the technical, tactical, and physical elements of each stroke.<\/p>\n<p>Greenbank is one of a star-studded line-up of current and former athletes who will also be sharing their stories with the attendees.<\/p>\n<p>He was one of British Swimming&#8217;s elite athletes who took part in the Manchester International Swim Meet and the more recent British Swimming Invitation Meet, both held at the Manchester Aquatics Centre.<\/p>\n<p>The 24-year-old wowed at both events, with his stand-out performance coming in the form of <a title=\"\" href=\"https:\/\/www.swimming.org\/sport\/luke-greenbank-new-british-record\/\" target=\"_blank\" rel=\"noopener noreferrer\">breaking a 10-year British record<\/a> in the 200m backstroke – after already setting a new personal best in the morning heats.<\/p>\n<p>Touching in 1:55.34, he shaved 0.24 off James Goddard&#8217;s long-standing record mark – a swim which has no doubt boosted his confidence ahead of what will be his first Olympic Games this summer.<\/p>\n<h2>&#8216;Over the moon&#8217;<\/h2>\n<p>Speaking after his record-breaking swim, Greenbank said: “I’m over the moon with that! I came into this meet wanting to build on the last one and to do that in the heats gave me great confidence for the final.<\/p>\n<p>&#8220;I’ve had my eyes on this one for a while, but I didn’t think I’d break it in-season, I thought it’d be at trials where I could have a go at it.<\/p>\n<p>“It feels absolutely amazing, and obviously it was James Goddard’s record before this and as a kid I watched him swim at an international level, so was he kind of an idol of mine, so to get that record is amazing.”<\/p>\n<p>Greenbank was one of a select number of athletes given the green-light to continue training throughout the pandemic.<\/p>\n<p>He has been working hard behind closed doors with his team in Loughborough, preparing as best he can for this summer&#8217;s competitions.<\/p>\n<p>“We’ve been fortunate enough to keep training, and the training I’ve been doing has been really good,&#8221; he said. &#8220;I can see how I’ve moved it on since last year, and seeing that progress is really giving me a lot of confidence.<\/p>\n<p>“I think with opportunities being pretty limited to get racing in, taking this opportunity is really important – and having that target of Tokyo, it’s the ultimate goal. I am really looking forward to getting out there.&#8221;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Decorated swimmer Luke Greenbank will be aiming to inspire the next generation of backstroke swimmers in Swim England’s Sharing Success series. The Loughborough-based athlete, who has been pre-selected for the upcoming Tokyo Olympic Games, is set to appear as a guest speaker on Saturday 20 March. Greenbank will be bringing his backstroke expertise to the session, &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/luke-greenbank-sharing-success-series\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":98,"featured_media":8949,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11083"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/98"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=11083"}],"version-history":[{"count":11,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11083\/revisions"}],"predecessor-version":[{"id":11276,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11083\/revisions\/11276"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/8949"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=11083"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=11083"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=11083"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":11262,"date":"2021-03-14T20:05:21","date_gmt":"2021-03-14T20:05:21","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=11262"},"modified":"2021-03-14T20:32:07","modified_gmt":"2021-03-14T20:32:07","slug":"british-records-fall-invitation-meet","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/british-records-fall-invitation-meet\/","title":{"rendered":"British records fall on final day of Manchester Invitation Meet"},"content":{"rendered":"<p>British records fell on the final day of action at the British Swimming Invitation Meet with Ellie Challis, Scott Quin, and Louis Lawlor all creating new entries for the record books.<\/p>\n<p>After missing out on her 50m backstroke British record earlier in the meet, Ellie Challis was back on record-breaking form as she took down her own mark in the Women&#8217;s Multi Class 100m Freestyle.<\/p>\n<p>The S3 swimmer set a new time of 1:53.01 in the event after already lowering <a href=\"https:\/\/www.swimming.org\/sport\/ellie-challis-shatters-british-record\/\">her previous record mark<\/a> of 1:55.30 in this morning&#8217;s heats (1:54.29). That mark gained her 506 multi-classification points.<\/p>\n<p>On her feat, Challis said: &#8220;I went in this morning and was feeling a bit heavy in the water but I put out a great time and I knew I could go out tonight feeling a lot better, so I just put everything into play and had a good competition.<\/p>\n<p>&#8220;I was really happy with my swims; my heats were a bit meh and then I went into the final and improved it – I did that all the way through the competition, improving heat to final, which was my goal.&#8221;<\/p>\n<p>Glaswegian Louis Lawlor set a new S14 British record of 1:01.61 in the Men&#8217;s MC 100m Backstroke, shaving 0.10 off Jordan Catchpole&#8217;s previous mark of 1:01.71.<\/p>\n<p>The final British record of the day came in the form of 2:27.83 for Paralympic silver medallist S14 swimmer Scott Quin in the Men&#8217;s Multi Class 200m Breaststroke.<\/p>\n<p>That time gained him 982 multi-classification points and goes into the record books as an official S14 record mark, bettering his own previous record of 2:30.45 from 2015.<\/p>\n<h2>Willmott, Litchfield, Jones on form<\/h2>\n<p>University of Stirling swimmer Aimee Willmott opened up the final session with a definite win in the Women&#8217;s 800m Freestyle, touching in a time of 8:42.88.<\/p>\n<p>Second-place Leah Crisp of Leeds touched in 8:49.66 after maintaining the pace with Willmott until the 500-metre mark. Michaella Glenister took third in 8:56.35.<\/p>\n<p>A winning display from Max Litchfield saw him take the Men&#8217;s 400m Individual Medley in 4:16.74, while Brodie Williams finished behind him in 4:21.52.<\/p>\n<p>National Centre Bath swimmer Jacob Greenow held off the competition to finish in third place with a time of 4:23.50.<\/p>\n<p>The Women&#8217;s 100m Butterfly delivered some close races with the top three finishers breaking the one minute mark. Cardiff-born and Loughborough-based swimmer Harriet Jones won the event in 59.03 &#8211; just 0.3 ahead of Keanna Macinnes (59.33).<\/p>\n<p>National Centre Bath&#8217;s Emily Large finished behind that duo to take third-place in 59.65.<\/p>\n<p>The Women&#8217;s Multi Class 100m Butterfly saw Aberdeen&#8217;s Toni Shaw (S9) winning in a time of 1:10.20 and gaining 705 points in the process, while second place went to Katie Crownhurst in 1:16.21 (544 points).<\/p>\n<p>Paralympian and World record-holder Stephen Clegg racked up 903 multi-classification points with his win in the Men&#8217;s 50m Butterfly. His time of 26.11 was almost a second ahead of second-place finisher and British record-holder Jordan Catchpole (27.04).<\/p>\n<p>Scotland&#8217;s Jack Milne (S14) touched in third with a time of 27.71.<\/p>\n<p>A stellar start and single breath in the Men&#8217;s 50m Butterfly saw Jacob Peters taking the win in that event with a time of 23.90, just under 0.20 of a second off his personal best of 23.74.<\/p>\n<p>Second place went to Lewis Fraser (24.50) with third going to Evan Jones in 25.17.<\/p>\n<h2>Hattrick for Dawson<\/h2>\n<p>Scottish record holder Kathleen Dawson has put on some impressive displays so far this weekend, yesterday becoming the second Briton ever to swim under the 59-second mark in the 100m Backstroke (58.65).<\/p>\n<p>The University of Stirling swimmer was on form again this evening as she took the win in the Women&#8217;s 200m Backstroke in another personal best time of 2:09.44 &#8211; completing the hattrick in the women&#8217;s backstroke events this weekend.<\/p>\n<p>Splitting 1:02.65 at the 100-metre mark, the Scot lead the race from the beginning. Fellow Stirling athlete Cassie Wild came in second in a massive personal best of 2:10.93, while third went to Honey Osrin in 2:13.25.<\/p>\n<p>Second place in that event went to Rhys Davies who was just off his personal best in 1:02.50.<\/p>\n<h2>Greenbank&#8217;s winning ways<\/h2>\n<p>Tokyo-bound Luke Greenbank put up another winning performance, this time in the Men&#8217;s 100m Backstroke (54.56). The National Centre Loughborough swimmer <a href=\"https:\/\/www.swimming.org\/sport\/luke-greenbank-new-british-record\/?utm_campaign=CompetitiveSwimming&amp;utm_medium=LukeGreenbankBreaksBritishRecord&amp;utm_source=NewsBlade\">broke James Goddard&#8217;s 10-year old record<\/a> in the 200m Backstroke yesterday and did the double in Manchester once again.<\/p>\n<p>Joe Litchfield touched just behind him in a time of 54.88, while third went to Brodie William&#8217;s in 55.39.<\/p>\n<p>A tight race in the Women&#8217;s 50m Breaststroke saw National Centre Loughborough&#8217;s Sarah Vasey coming out on top with a mark of 30.66, while Imogen Clark was behind her 30.97. An official British record was set by Paralympic silver medallist Scott Quin in the Men&#8217;s Multi-Class 200m Breaststroke, who touched in 2:27.83.<\/p>\n<p>That time gained him 982 multi-classification points and goes into the record books as an official S14 record mark, bettering his own previous record of 2:30.45 from 2015.<\/p>\n<p>The Men&#8217;s 200m Breaststroke saw National Centre Loughborough&#8217;s James Wilby winning the event in 2:11.24. Wilby is set to make his <a href=\"https:\/\/www.swimming.org\/sport\/first-four-olympic-selections-announced\/\">Olympic debut<\/a> alongside teammate Luke Greenbank at this summer&#8217;s Games.<\/p>\n<p>Stirling&#8217;s Ross Murdoch touched in 2:12.88 to take second place, while youngster Gregory Butler finished in this with 2:13.88.<\/p>\n<h2>Hopkin wins freestyle battle<\/h2>\n<p>Anna Hopkin got the win over Freya Anderson in the Women&#8217;s 100m Freestyle, who touched in 54.44 and 54.51, respectively. Third place finisher and Edinburgh swimmer Lucy Hope was still under the 55-second mark with her time of 54.94.<\/p>\n<p>The Women&#8217;s MC 100m Freestyle was won by Northampton&#8217;s Zara Mullooly by the smallest of margins &#8211; just 0.01 of a second. 1:01.41 was just enough for Mullooly to hold off Louise Fiddes, who touched in 1:01.42. Third in this event went to Hannah Russell in a time of 1:02.29.<\/p>\n<p>Plymouth Leander swimmer and multi World record holder Reece Dunn posted a time of 1:59.56 in the Men&#8217;s Multi-Class 200m Freestyle, taking the win ahead of Scotland&#8217;s Oliver Carter (2:02.89).<\/p>\n<p>Dylan Broom touched in a time of 2:04.17 to become the third athlete home.<\/p>\n<h2>Scott on top<\/h2>\n<p>Duncan Scott certainly made his mark in what was a stacked field in the Men&#8217;s 200m Freestyle. He took the win in a time of 1:46.70, which is the third-fastest time in the world so far this year.<\/p>\n<p>Speaking on his win in the event, Scott said: &#8220;200 Free in Britain is always good fun! I’ve been doing some race simulations at home, but to come here and race some other guys has been really good. It was just so tight and that’s what’s so good about it – head to head racing gets a bit more out of you – it’s really good looking ahead to trials and the 4&#215;200 relay.<\/p>\n<p>He added: &#8220;There’s still plenty to do and plenty to learn. Some of the times were good but I think some of the execution of skills, there’s a lot of room to improve. I’m quite happy with where I am and I’ve got a final phase now and then into taper, so I’m quite excited for the next block.&#8221;<\/p>\n<p>Second place went to Tom Dean who was just 0.05 behind the Scotsman (1:46.75) and just 0.7 off his personal best in that event. Dean told British Swimming after the event: &#8220;I just wanted to come here and move it on from the Manchester International – that was the main aim. I had a bit of a shaky start to the three days in that 400, feeling a bit tired from training, but to finish off with that is good.<\/p>\n<p>&#8220;GB 200 free is just a stacked event and it’s always going to be an exciting race when you’ve got eight top guys going head to head &#8211; that only bodes well for trials in a months’ time.&#8221;<\/p>\n<p>Third-place finisher in that event was Olympic silver medallist James Guy (1:47.47), who gave an impressive fight from the outside of the pool.<\/p>\n<p>The penultimate event of the session saw Scotland&#8217;s Abby Kane taking the win in the Women&#8217;s Multi-Class 200m Individual Medley (2:45.36, 630 points).<\/p>\n<p>British and World record holder Maisie Summers-Newton was next to the wall in a time of 3:00.09 (953), while Paralympic hopeful Grace Harvey followed just behind in 3:02.46 (916 points).<\/p>\n<p>The competition was rounded off with the Women&#8217;s 200m Individual Medley, which saw a tight battle between winner Candice Hall (2:15.12) and second place Lily Booker (2:15.41).<\/p>\n<p>The Loughborough and Milfield swimmers were followed closely by Scottish youngster Katie Shanahan, who touched in 2:16.40.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>British records fell on the final day of action at the British Swimming Invitation Meet with Ellie Challis, Scott Quin, and Louis Lawlor all creating new entries for the record books. After missing out on her 50m backstroke British record earlier in the meet, Ellie Challis was back on record-breaking form as she took down &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/british-records-fall-invitation-meet\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":98,"featured_media":11263,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11262"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/98"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=11262"}],"version-history":[{"count":3,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11262\/revisions"}],"predecessor-version":[{"id":11266,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11262\/revisions\/11266"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/11263"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=11262"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=11262"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=11262"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":11253,"date":"2021-03-13T20:15:12","date_gmt":"2021-03-13T20:15:12","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=11253"},"modified":"2021-03-13T22:43:42","modified_gmt":"2021-03-13T22:43:42","slug":"james-guy-british-swimming-invitational-meet","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/james-guy-british-swimming-invitational-meet\/","title":{"rendered":"James Guy blows away competition at British Swimming Invitational Meet"},"content":{"rendered":"<p>James Guy blew away his competition on day two of the British Swimming Invitational Meet as he continued his great form.<\/p>\n<p>The Bath National Centre swimmer finished almost four seconds ahead in the Men’s 200m Butterfly to make it back-to-back 1:56 times in this event.<\/p>\n<p>Guy <a title=\"James is the Guy as he impresses with commanding Manchester victory\" href=\"https:\/\/www.swimming.org\/sport\/james-guy-commanding-win-manchester\/\">claimed victory at the Manchester International Swim Meet<\/a> in February with a time of 1:56.34 and followed it with another impressive performance, but this time he was just outside of that, clocking in at 1:56.79.<\/p>\n<p>The Olympic silver medallist was 3.72 seconds in front of Northampton’s Ed Mildred, who finished in 2:00.07 to take second place.<\/p>\n<p>Bath teammate, Jacob Peters, was in third (2:01.35) with all three swimmers improving on their heat times.<\/p>\n<h2>Freya wins freestyle battle<\/h2>\n<p>Freya Anderson and Abbie Wood battled it out yet again in the Women’s 200m Freestyle final.<\/p>\n<p>Anderson, who is the third quickest Brit of all time in this event, finished strongly to take the win in a time of 1:58.23.<\/p>\n<p>Wood, of Buxton Swimming Club, was just 0.19 seconds behind finishing in 1:58.42. She was followed by Loughborough’s Candice Hall who swam a new personal best of 2:00.52 to finish in third place.<\/p>\n<p>The Women’s Multi Class 200m Freestyle final saw Zara Mullooly lower her own British para-swimming record in the S10 category, swimming a time of 2:13.30 to rack up 898 multi-classification points.<\/p>\n<p>Aberdeen’s Toni Shaw (S9) was in second place in that race with 863 points and a time of 2:16.40 with third place taken by S14 Hatfield swimmer Louise Fiddes who clocked in at 2:14.26 and earning 751 points.<\/p>\n<h2>Stirling swims from the Scots<\/h2>\n<p>Kathleen Dawson became only the second ever Briton to swim under 59 seconds in the Women’s 100m Backstroke.<\/p>\n<p>The University of Stirling swimmer claimed a massive personal best as she touched the wall in 58.65 seconds, beating her PB from the heats and adding to her 50m Backstroke PB during day one of the event.<\/p>\n<p>On her performance, Dawson said: “I’m over the moon with that! I mean I don’t want to toot my own horn, but I kind of expected to go a 58 because I’ve been swimming so well at these time trials we’ve been doing in Stirling, so it was expected, but I’m still buzzing with it.<\/p>\n<p>“This morning I had kind of relaxed the first fifty so I knew I had more to give in the first fifty tonight, and then I just wanted to repeat the second fifty like I did this morning so it all just came together.”<\/p>\n<p>Her teammate, Cassie Wild, was the only other swimmer to finish under the minute mark with her time of 59.56 seconds. In third was Welsh swimmer Medi Harris, finishing in 1:01.19.<\/p>\n<p>Another Stirling swimmer, Abby Kane, came second in the Women’s Multi Class 100m Backstroke but was beaten by City of Manchester’s Hannah Russell (S12).<\/p>\n<p>Russell’s multi-classification points total was 844 after her time of 1:09.90. S13 swimmers Kane (1:12.57) finished on 100 less with 744 and Katie Crowhurst of Wycombe (1:15.36) accumulated 664 points.<\/p>\n<h2>All-star line ups<\/h2>\n<p>The Men’s 200m Individual Medley and Women’s 100m Breaststroke saw the best of the best race against each other with some close finishes.<\/p>\n<p>The men’s event featured Max and Joe Litchfield, Duncan Scott and the newly crowned 200m Backstroke British record holder, Luke Greenbank.<\/p>\n<p>Scott finished on top of the pile with his time of 1:59.36, after also qualifying quickest in the heats. He was pushed all the way by Joe Litchfield, who finished just 0.35 seconds behind him (1:59.71).<\/p>\n<p>The senior Litchfield brother, Max, was just outside the two minute mark and claimed third place (2:00.96).<\/p>\n<p>The women’s event saw five of the top 10 British performers of all time in the event – Sarah Vasey, Molly Renshaw, Kayla Van Der Merwe, Jocelyn Ulyett and Imogen Clark – face each other.<\/p>\n<p>Vasey and Renshaw were not far from new personal best times, with the former finishing first with a time of 1:07.09 and the latter clocking in at 1:07.42 – just 0.33 seconds separating the pair.<\/p>\n<p>It was Winchester’s Clark who was next to touch the wall, finishing in 1:08.29.<\/p>\n<h2>Peaty and Willmott secure wins<\/h2>\n<p>The <a title=\"Peaty breaks 50m breaststroke world record\" href=\"https:\/\/www.swimming.org\/sport\/peaty-breaks-50m-breaststroke-world-record-twice-day-three\/\" target=\"_blank\" rel=\"noopener noreferrer\">current world record holder in the Men’s 50m Breaststroke<\/a>, Adam Peaty, produced another great performance as he continues to build up to the Olympics.<\/p>\n<p>The 26-year-old added to his 100m Breaststroke win on day one with a victory in the 50m event.<\/p>\n<p>It was the same names featuring in first and second place in both events, as Peaty finished in 26.80 seconds with James Wilby next up with a time of 27.77 seconds.<\/p>\n<p>Oxford’s David Murphy was close to a personal best time with his 27.84 which placed him in third.<\/p>\n<p>Meanwhile, earlier in the session Aimee Willmott set the sixth quickest time in the world this year in the Women’s 400m Individual Medley.<\/p>\n<p>Willmott, who was a finalist in this event at the 2016 Olympic Games in Rio, improved on her time from the heats to record a 4:39.11 finish.<\/p>\n<p>It was a battle of the junior swimmers for second and third, as Millfield’s Lily Booker (4:47.39) touched ahead of Freya Colbert (4:49.75) of Nova Centurion Swimming Club.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>James Guy blew away his competition on day two of the British Swimming Invitational Meet as he continued his great form. The Bath National Centre swimmer finished almost four seconds ahead in the Men’s 200m Butterfly to make it back-to-back 1:56 times in this event. Guy claimed victory at the Manchester International Swim Meet in &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/james-guy-british-swimming-invitational-meet\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":77,"featured_media":11254,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11253"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/77"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=11253"}],"version-history":[{"count":6,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11253\/revisions"}],"predecessor-version":[{"id":11260,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11253\/revisions\/11260"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/11254"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=11253"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=11253"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=11253"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":11219,"date":"2021-03-13T12:27:02","date_gmt":"2021-03-13T12:27:02","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=11219"},"modified":"2021-03-29T10:43:40","modified_gmt":"2021-03-29T10:43:40","slug":"positive-feedback-sharing-success","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/positive-feedback-sharing-success\/","title":{"rendered":"Positive feedback for ‘inspiring and motivating’ series ahead of final workshops"},"content":{"rendered":"<p>The Sharing Success series has been labelled inspiring and motivating ahead of the remaining six days of workshops available.<\/p>\n<p>Recent feedback from attendees has revealed that 98% would recommend the workshops to a friend and more than half said the sessions exceeded their expectations.<\/p>\n<p>One of the latest installments of the series featured Olympic silver medallist James Guy, who spoke candidly about having an open mindset, transitioning from a junior to a senior athlete, pre-race nerves, and the school-training balance.<\/p>\n<!-- Start content block: sharing-success-book-btn -->\n    <style type=\"text\/css\">\n        .btn-container {\r\n    text-align: center;\r\n}\r\n.book-now-btn {\r\n  border: none;\r\n  color: white;\r\n  padding: 15px 32px;\r\n  text-align: center;\r\n  text-decoration: none;\r\n  display: inline-block;\r\n  font-size: 16px;\r\n  cursor: pointer;\r\n  background-color: #4CAF50;\r\n  margin-bottom: 15px;\r\n}\n    <\/style>\n    <div class=\"btn-container\"><a href=\"https:\/\/www.swimming.org\/sport\/sharing-success-series\/\" target=\"_self\"><button class=\"book-now-btn\">Book Here<\/button><\/a><\/div>\n<!-- End content block: sharing-success-book-btn -->\n\n<p>&#8220;All the greats in sport have had problems that they have overcome&#8221;, he said, while addressing the group of 13-14-year-olds.<\/p>\n<p>He reflected on his time as a young swimmer, saying: &#8220;As a youngster, what really helped me was doing all four strokes and that gave me a good background to start off with.&#8221;<\/p>\n<p>When asked what advice he would give to his younger self, Guy replied: &#8220;Don&#8217;t put too much pressure on yourself and enjoy what your doing.&#8221;<\/p>\n<p>Two pieces of advice he shared were: &#8220;Nerves are a good thing, it&#8217;s how you get fired up for a race. Use it as an energy tool.<\/p>\n<p>&#8220;It&#8217;s [open mindset] massively important. Having trust in the process of what you&#8217;re doing, having a clear head is what you need to do.&#8221;<\/p>\n<h2>Upcoming workshops<\/h2>\n<p>Olympic medallists Siobhan-Marie O&#8217;Connor and Rebecca Adlington are among the athletes who will be making appearances across the remaining six days of workshops.<\/p>\n<p>Commonwealth Games gold medallists James Goddard and James Wilby, World Championship medallist Luke Greenbank, and Paralympic hopeful and European record holder Grace Harvey are also set to take part in the upcoming sessions.<\/p>\n<p>Many of the athletes are racing at the British Swimming Invitational Meet which is being held at the Manchester Aquatics Centre from March 12-14.<\/p>\n<p>Day one of the competition saw <a title=\"\" href=\"https:\/\/www.swimming.org\/sport\/luke-greenbank-new-british-record\/\" target=\"_blank\" rel=\"noopener noreferrer\">Luke Greenbank smashing a 10-year British Record<\/a> in the 200m backstroke which was previously held by James Goddard.<\/p>\n<p>The first workshop saw <a title=\"\" href=\"https:\/\/www.swimming.org\/sport\/max-litchfield-sharing-success-series\/\" target=\"_blank\" rel=\"noopener noreferrer\">Olympian Max Litchfield<\/a> discussing his career, past injuries, positive mindset, and work ethic to the group of 12 and under medley swimmers.<\/p>\n<p>The 25-year-old medley specialist, who finished fourth in the 400m individual medley at the Rio 2016 Olympics, told the attendees: “I was out of the water for almost a year and you guys have probably been out of the water a bit longer than that.&#8221;<\/p>\n<p>Inspiring the youngsters by sharing his story, he added: “When I was out of the water, I was doing everything I could on land. You can work on things on land that make you a better swimmer once you get back.&#8221;<\/p>\n<h2>&#8216;Fantastic&#8217;<\/h2>\n<p>Grant Robins, Swim England head of swimming talent, said of the series so far: &#8220;The workshops have been fantastic and the level of engagement by the swimmers really high, which is humbling to see.<\/p>\n<p>&#8220;Our guest athletes have been both inspiring and motivating for these youngsters, and have spoken honestly about their careers so far. They are all great ambassadors for our sport and the Swim England Talent team is looking forward to the upcoming webinars&#8221;.<\/p>\n<p>Para-swimming talent coach, Tom McManus, is one member of the team of four who has been delivering some of the technical content throughout the sessions.<\/p>\n<p>He said: &#8220;We feel the attendees are really absorbing the information, which ultimately is designed to help shape and improve their overall performance as an athlete.<\/p>\n<p>&#8220;Myself and my colleagues are excited to be delivering these sessions and look forward to the rest of the series.&#8221;<\/p>\n<p>Our Category 2 members for 2021 will now be able to book onto the workshops by using the button below instead of requiring an email to gain access to the booking system.<\/p>\n<p>Please view the <a title=\"FAQs\" href=\"https:\/\/www.swimming.org\/library\/documents\/5094\/download\">Frequently Asked Questions document<\/a> for more details and if your query has not been answered, please contact <a href=\"mailto:Successseries@swimming.org\">Successseries@swimming.org.<\/a><\/p>\n<!-- Start content block: sharing-success-book-btn -->\n    <style type=\"text\/css\">\n        .btn-container {\r\n    text-align: center;\r\n}\r\n.book-now-btn {\r\n  border: none;\r\n  color: white;\r\n  padding: 15px 32px;\r\n  text-align: center;\r\n  text-decoration: none;\r\n  display: inline-block;\r\n  font-size: 16px;\r\n  cursor: pointer;\r\n  background-color: #4CAF50;\r\n  margin-bottom: 15px;\r\n}\n    <\/style>\n    <div class=\"btn-container\"><a href=\"https:\/\/www.swimming.org\/sport\/sharing-success-series\/\" target=\"_self\"><button class=\"book-now-btn\">Book Here<\/button><\/a><\/div>\n<!-- End content block: sharing-success-book-btn -->\n\n<div class=\"highlightbox\">\n<h4>Saturday 20 March<\/h4>\n<ul>\n<li>10am-12pm, Backstroke, 13-14 age group, with Luke Greenbank<\/li>\n<li>1-3pm, Backstroke, 15-16 age group, with Luke Greenbank<\/li>\n<li>4-6pm,Backstroke, 17-24 age group, with Luke Greenbank<\/li>\n<\/ul>\n<h4>Sunday 21 March<\/h4>\n<ul>\n<li>9-11am, Breaststroke, 13-14 age group, with James Wilby and Maisie Summers-Newton<\/li>\n<li>12-2pm, Breaststroke, 15-16 age group, with James Wilby and Maisie Summers-Newton<\/li>\n<li>3-5pm, Breaststroke, 17-24 age group, with James Wilby and Maisie Summers-Newton<\/li>\n<\/ul>\n<h4>Saturday 27 March<\/h4>\n<ul>\n<li>9-11am, Distance Freestyle, 13-14 age group, with Rebecca Adlington<\/li>\n<li>12-2pm, Distance Freestyle, 15-16 age group, with Rebecca Adlington<\/li>\n<li>3-5pm, Distance Freestyle, 17-24 age group, with Rebecca Adlington<\/li>\n<\/ul>\n<h4>Sunday 28 March<\/h4>\n<ul>\n<li>9-11am, Medley, 13-14 age group, with Siobhan-Marie O&#8217;Connor and Grace Harvey<\/li>\n<li>12-2pm, Medley, 15-16 age group, with Siobhan-Marie O&#8217;Connor and Grace Harvey<\/li>\n<li>3-5pm, Medley, 17-24 age group, with Siobhan-Marie O&#8217;Connor and Grace Harvey<\/li>\n<\/ul>\n<h4>Sunday 11 April<\/h4>\n<ul>\n<li>9-11am, Medley, 10-12 age group, with James Goddard<\/li>\n<li>12-2pm, Masters, with Jo Corben<\/li>\n<li>3-5pm, Open Water, with guest athlete<\/li>\n<\/ul>\n<\/div>\n<div class=\"highlightbox\">\n<h4>Registration closing dates<\/h4>\n<ul>\n<li>6 and 7 March: 12 noon, 4 March<\/li>\n<li>20 and 21 March: 12 noon, 18 March<\/li>\n<li>27 and 28 March: 12 noon, 25 March<\/li>\n<li>11 April: 12 noon, 8 April<\/li>\n<\/ul>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>The Sharing Success series has been labelled inspiring and motivating ahead of the remaining six days of workshops available. Recent feedback from attendees has revealed that 98% would recommend the workshops to a friend and more than half said the sessions exceeded their expectations. One of the latest installments of the series featured Olympic silver &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/positive-feedback-sharing-success\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":98,"featured_media":11246,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11219"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/98"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=11219"}],"version-history":[{"count":20,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11219\/revisions"}],"predecessor-version":[{"id":11284,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11219\/revisions\/11284"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/11246"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=11219"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=11219"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=11219"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":11234,"date":"2021-03-12T19:12:32","date_gmt":"2021-03-12T19:12:32","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=11234"},"modified":"2021-03-12T20:48:37","modified_gmt":"2021-03-12T20:48:37","slug":"luke-greenbank-new-british-record","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/luke-greenbank-new-british-record\/","title":{"rendered":"Impressive Greenbank rewrites the record books as he smashes 10-year British best"},"content":{"rendered":"<p>Luke Greenbank smashed a 10-year record as he sent a message of intent to the rest of the world with a phenomenal performance at the British Swimming Invitation Meet.<\/p>\n<p>After setting a new personal best of 1:55.69 in Men’s 200m Backstroke heats, the Cockermouth swimmer broke James Goddard’s long-standing British best in the day one finals at the Manchester Aquatics Centre.<\/p>\n<p>The 24-year-old, who has <a title=\"Luke Greenbank selected for Tokyo 2020 Olympic Games\" href=\"https:\/\/www.swimming.org\/sport\/first-four-olympic-selections-announced\/\" target=\"_blank\" rel=\"noopener noreferrer\">already been selected for the rearranged Tokyo 2020 Olympic Games<\/a>, finished in 1:55.34 to shave 0.24 seconds off Goddard’s record of 1:55.58 that was set as he stormed to gold in the 2010 Delhi Commonwealth Games.<\/p>\n<p>Greenbank was a huge 5.30 seconds ahead of his nearest rival, Loughborough University’s Elliott Clogg, who clocked 2:00.64.<\/p>\n<p>Bath University’s Jacob Greenow was 6.70 seconds adrift of the impressive Greenbank as he finished in 2:02.04.<\/p>\n<p>After swimming the fastest 200m Backstroke time in the word this year, a delighted Greenbank said: “I’m over the moon with that!<\/p>\n<p>“I came into this meet wanting to build on the last one and to do that in the heats gave me great confidence for the final.<\/p>\n<p>“I’ve had my eyes on this one for a while, but I didn’t think I’d break it in-season, I thought it’d be at trials where I could have a go at it.<\/p>\n<p>“It feels absolutely amazing, and obviously it was James Goddard’s record before this and as a kid I watched him swim at an international level, so was he kind of an idol of mine, so to get that record is amazing.”<\/p>\n<h2>Molly so close<\/h2>\n<p>Molly Renshaw was only seven-tenths outside a new British record in the Women’s 200m Breaststroke.<\/p>\n<p>Representing Ripley at this meet, Renshaw touched home in 2:22.78 – 0.70 adrift of Jocelyn Ulyett’s record of 2:22.08, which has stood since April 2017.<\/p>\n<p>Loughborough University’s Ulyett was second behind Renshaw in 2:26.19, with City of Manchester Aquatics’ Katie Matts third in 2:26.70.<\/p>\n<h2>Normal service from Ben and Adam<\/h2>\n<p>Plymouth Leander’s Ben Proud marked his return to competitive action with a quick time of 22.15 in the Men’s 50m Freestyle final.<\/p>\n<p>It was 0.66 clear of Bath University’s Matthew Richards’ 22.81, while Edinburgh University’s David Cambridge was third in 22.99.<\/p>\n<p>Adam Peaty continued his dominance of the Men’s 100m Breaststroke as he cruised to victory ahead of James Wilby.<\/p>\n<p>Peaty, representing his home club of City of Derby, finished in 58.52 – the fastest 100m Breaststroke long course time in the past 12 months – with Loughborough University’s James Wilby 0.79 seconds behind in 59.31.<\/p>\n<p>University of Stirling’s Ross Murdoch was third in 1:01.38.<\/p>\n<p>Peaty said: “I think off the last month I executed the race plan really well, but it was a hard race in terms of getting up for it.<\/p>\n<p>“I think the biggest challenge now as athletes is getting yourself into that zone where you can perform when there’s an empty crowd and you can’t feel the awe around the place.<\/p>\n<p>“I did what I could; you know it’s still extremely fast – that would probably medal at worlds – so I’m in a very good place.”<\/p>\n<h2>James and Holly cruise to wins<\/h2>\n<p>James Guy was more than a second clear of the field as he took the Men’s 100m Butterfly.<\/p>\n<p>His time of 51.71 was 1.02 ahead of his Bath Unversity team-mate Jacob Peters, who recorded 52.72, while Loughborough University’s Joe Litchfield set a new personal best as he finished third in 52.86.<\/p>\n<p>Holly Hibbott cruised to victory by an impressive 4.29 seconds in the Women’s 400m Freestyle.<\/p>\n<p>The Bath University 22-year-old put on a very dominant display as she finished in 4:12.26 – leading from start to finish.<\/p>\n<p>Hibbott’s Bath team-mate Leah Crisp was took second spot in 4:16.55, with Nova Centurion’s Freya Colbert third in a time of 4:17.73.<\/p>\n<p>Zara Mulloolly triumphed on multi-classification points in the Women’s MC 400m Freestyle.<\/p>\n<p>The S10 Northampton Swimming Club 19-year-old finished in a time of 4:41.56 to earn 874 points.<\/p>\n<p>That put her eight clear of Camden Swiss’s Ellie Simmonds, who clocked 5:28.65 for 866 points and second spot – one clear of her fellow S6 swimmer Maisie Summers-Newton (Northampton) who finished third on 865 for her time of 5:28.82.<\/p>\n<h2>Anna dashes Lucy&#8217;s Hope<\/h2>\n<p>Ealing’s Anna Hopkin was only 0.04 seconds in front of Edinburgh University’s Lucy Hope in the Women’s 50m Freestyle.<\/p>\n<p>Only 0.20 seconds separated the top three with Hopkin home first in 25.46, Hope second in 25.50 and Bromley’s Evelyn Davis third in a new personal best of 5.66.<\/p>\n<p>City of Manchester Aquatic’s Michael Jones was victorious in the Men’s MC 400m Freestyle after picking up 849 points.<\/p>\n<p>The S7 swimmer finished in 4:48.88 which earned him 41 more points than Borough of Kirklees’s S9 swimmer Jonathan Booth, who finished with 808 points for his time of 4:28.29<\/p>\n<p>Torfaen’s Dylan Broom (S14) was third with 790 points after touching home in 4:26.61.<\/p>\n<p>Laura Stephens edged out Emily Large to win the Women’s 200m Butterfly.<\/p>\n<p>Plymouth Leander’s Stephens’ winning time of 2:08.58 was was 0.96 seconds clear of Bath University’s Large, 2:09.54, with University of Stirling’s Keanna Macinnes third in 2:09.88.<\/p>\n<p>Swansea University’s Daniel Jervis was the only competitor to go under 3:50 in the Men’s 400m Freestyle.<\/p>\n<p>He clocked 3:49.74 to finish comfortably clear of the Bath University duo of Luke Turley (3:52.21) and Tom Dean (3:54.27), who were second and third respectively.<\/p>\n<h2>So near for Ellie<\/h2>\n<p>Ellie Challis was just outside the British record she set in the Women’s MC 50m Backstroke final at the Manchester International Swim Meet last month.<\/p>\n<p>The S3 Clacton Swimming Club 17-year-old was swimming on her own and was only 1.05 seconds outside her own British best of 55.61 as she touched home in 56.66 for 626 points.<\/p>\n<p>Mulloolly claimed a second win of the night in the Women’s MC 50m Freestyle after clocking 29.01 for 839 points.<\/p>\n<p>Hatfield’s S14 swimmer Louise Fiddes was second with 809 points for her time of 28.27, with university of Stirling’s S13 swimmer Abby Kane earning 690 points and third spot for her time of 30.17.<\/p>\n<p>Jordan Catchpole was narrowly outside his British record in the Men’s MC 50m Freestyle.<\/p>\n<p>The Team Waveney S14 swimmer finished in 25.03 for 820 points – only 0.30 seconds outside his British best of 24.73 he set at last month’s Manchester International Swim Meet.<\/p>\n<p>University of Stirling’s Kathleen Dawson set a new personal best of 27.63 in the Women’s 50m Backstroke final.<\/p>\n<p>She was 0.43 ahead of Swansea University’s Georgia Davies (28.06), with University of Stirling’s Cassie Wild third in 28.37.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Luke Greenbank smashed a 10-year record as he sent a message of intent to the rest of the world with a phenomenal performance at the British Swimming Invitation Meet. After setting a new personal best of 1:55.69 in Men’s 200m Backstroke heats, the Cockermouth swimmer broke James Goddard’s long-standing British best in the day one &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/luke-greenbank-new-british-record\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":65,"featured_media":11238,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11234"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/65"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=11234"}],"version-history":[{"count":7,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11234\/revisions"}],"predecessor-version":[{"id":11245,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11234\/revisions\/11245"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/11238"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=11234"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=11234"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=11234"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":11210,"date":"2021-03-09T19:54:34","date_gmt":"2021-03-09T19:54:34","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=11210"},"modified":"2021-03-09T19:54:34","modified_gmt":"2021-03-09T19:54:34","slug":"emily-large-first-club","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/emily-large-first-club\/","title":{"rendered":"Emily Large says club swimming helped shape her as a swimmer and person"},"content":{"rendered":"<p>Butterfly specialist Emily Large reassures swimmers that it’s ‘never too late to join a club’ as she reveals how club swimming has shaped her as an athlete and a person.<\/p>\n<p>The 20-year-old says she believes being part of a club gives people ‘more opportunity in life’ due to the skills that are learned.<\/p>\n<p>Emily says her parents often reminisce about her dislike of being in the water from her early days of learning to swim.<\/p>\n<!-- Start content block: supporter-membership-btn -->\n    <style type=\"text\/css\">\n        .btn-container {\r\n    text-align: center;\r\n}\r\n.supporter-btn {\r\n  border: none;\r\n  color: white;\r\n  padding: 15px 32px;\r\n  text-align: center;\r\n  text-decoration: none;\r\n  display: inline-block;\r\n  font-size: 16px;\r\n  cursor: pointer;\r\n  background-color: #4CAF50;\r\n  margin-bottom: 15px;\r\n}\n    <\/style>\n    <div class=\"btn-container\"><a href=\"https:\/\/support.swimming.org\/\" target=\"_blank\"><button class=\"supporter-btn\">Join us and make your voice heard<\/button><\/a><\/div>\n<!-- End content block: supporter-membership-btn -->\n\n<p>However, her swimming teacher spotted the potential, as the now Bath National Centre swimmer explains: “My swimming teacher that I had told my mum and dad and was like, ‘she’d be a good little swimmer’.<\/p>\n<p>“My sister was involved with the swimming club at Ponteland at the time and I just said to my mum and dad that I’d quite like to get involved. She’s probably the one that introduced me to the other side of swimming, the competitive side.”<\/p>\n<p>Beginning her club swimming journey at Ponteland Swimming Club aged seven, Emily began swimming competitively at eight years old.<\/p>\n<p>“I was at Ponteland until I think it was age 11 or 12 and then I moved to what was City of Newcastle, which then merged with another local swimming club to become what’s now Newcastle Swim Team.<\/p>\n<p>“I stayed there for about eight years or so and then moved to the national centre at Bath in September just gone,” she added.<\/p>\n<p>There was less than 10 years since Emily had her first taste of competitive swimming experience at aged eight, to competing in the Commonwealth Games on Australia’s Gold Coast in 2018.<\/p>\n<h2>Wider outlook on life<\/h2>\n<img class=\"alignnone size-full wp-image-11214\" src=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2021\/03\/EmilyLarge2015.jpg\" alt=\"Emily Large swimming for Newcastle Swim Team\" srcset=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2021\/03\/EmilyLarge2015.jpg 1200w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2021\/03\/EmilyLarge2015-300x169.jpg 300w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2021\/03\/EmilyLarge2015-768x432.jpg 768w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2021\/03\/EmilyLarge2015-1024x576.jpg 1024w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2021\/03\/EmilyLarge2015-220x124.jpg 220w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2021\/03\/EmilyLarge2015-440x248.jpg 440w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2021\/03\/EmilyLarge2015-660x371.jpg 660w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/>\n<p>In that time, her personal development had also grown, and she explains the role that her swimming played.<\/p>\n<p>Emily said: “Having swimming there while I was still at school gave me a lot of skills which I learned, those being time management and making sure I was organised.<\/p>\n<p>“That made sure that I was doing my school work on time and stuff. If I didn’t have swimming I think I could’ve got a bit lazier but with swimming being there, it actually taught me a lot of skills that I can take on into later life.<\/p>\n<p>“Swimming’s now my job so it definitely shaped me as a swimmer and as a person as a whole because it gives you a wider outlook on life.<\/p>\n<p>“Everything you do in the pool you can apply to everyday life and it’s just something that I’d definitely recommend getting involved in.<\/p>\n<p>“It’s never too late to join a club. You hear a lot of people who have made Olympic success and they say they started in their late teens and stuff so it’s never too late.<\/p>\n<p>“It’s also just a vital life skill that you want to have when you’re older being able to swim.<\/p>\n<p>“You meet a lot of new people along the way so it’s just something which you can kind of branch out and open out and it gives you more opportunity in life I’d say.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Butterfly specialist Emily Large reassures swimmers that it’s ‘never too late to join a club’ as she reveals how club swimming has shaped her as an athlete and a person. The 20-year-old says she believes being part of a club gives people ‘more opportunity in life’ due to the skills that are learned. Emily says &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/emily-large-first-club\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":77,"featured_media":11213,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11210"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/77"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=11210"}],"version-history":[{"count":5,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11210\/revisions"}],"predecessor-version":[{"id":11217,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11210\/revisions\/11217"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/11213"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=11210"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=11210"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=11210"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":11193,"date":"2021-03-07T09:42:01","date_gmt":"2021-03-07T09:42:01","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=11193"},"modified":"2021-03-07T09:48:56","modified_gmt":"2021-03-07T09:48:56","slug":"supple-strength-advanced-moves","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/supple-strength-advanced-moves\/","title":{"rendered":"Advanced moves for supple strength workout"},"content":{"rendered":"<p>Swim England para-swimming trainer Sam Cooper focuses on advanced moves in her fifth supple strength session.<\/p>\n<p>This latest workout will introduce and guide you though squat to calf raisers, squat with rotation, downward-dog press ups, arm circles and toe taps in table-top and side-star in four-point kneeling.<\/p>\n<p>Participants should be fit enough to undertake exercise and have completed the previous lessons in this series prior to starting these advanced moves.<\/p>\n<p><strong>Here are the previous sessions if you&#8217;ve not already completed them:<\/strong><\/p>\n<ul>\n<li><a title=\"Sun Salutation movements for supple strength\" href=\"https:\/\/www.swimming.org\/sport\/sun-salutation-supple-strength-sequence\/\" target=\"_blank\" rel=\"noopener noreferrer\">Sun Salutation<\/a><\/li>\n<li><a title=\"Squats, table-top and four-point kneeling\" href=\"https:\/\/www.swimming.org\/sport\/squats-table-top-four-point-kneeling-workout\/\" target=\"_blank\" rel=\"noopener noreferrer\">Squats, table-top and four-point kneeling<\/a><\/li>\n<li><a title=\"Balance exercises for supple strength workout\" href=\"https:\/\/www.swimming.org\/sport\/supple-strength-balance-workout\/\" target=\"_blank\" rel=\"noopener noreferrer\">Balance<\/a><\/li>\n<li><a title=\"Full sequence for supple strength\" href=\"https:\/\/youtu.be\/nplplf0UacU\" target=\"_blank\" rel=\"noopener noreferrer\">Full sequence<\/a><\/li>\n<\/ul>\n<p>You only need a clear space to perform these exercises. If you don’t have a yoga mat, it is fine to do these on carpet.<\/p>\n<p>Once you&#8217;re ready, hit play on the video below.<\/p>\n<div class=\"video-container\"><iframe src=\"https:\/\/www.youtube.com\/embed\/K8RSvFc3d5k?rel=0\" width=\"640\" height=\"360\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/div>\n<h2>Squat to calf raisers<\/h2>\n<ul>\n<li>Feet hip-width apart and facing forward<\/li>\n<li>Lower into a squat with weight into your heels<\/li>\n<li>Come back to the start position, then lift up onto the balls of your feet<\/li>\n<li>Take your arms out behind you to counterbalance your weight<\/li>\n<li>Gently lower your heels back down onto the mat<\/li>\n<li>Repeat five times<\/li>\n<li>Return to start position.<\/li>\n<\/ul>\n<h2>Squat with rotation<\/h2>\n<ul>\n<li>Feet hip-width apart and facing forward<\/li>\n<li>Lower into a squat position with weight into your heels<\/li>\n<li>Holding the squat position, gently rotate to the right and return to centre<\/li>\n<li>Still in the squat position, gently rotate to the left and return to centre<\/li>\n<li>Return to standing<\/li>\n<li>Repeat five times.<\/li>\n<\/ul>\n<h2>Downward-dog press ups for biceps and triceps<\/h2>\n<ul>\n<li>Feet hip-width apart and facing forward<\/li>\n<li>Hinge from the waist and bend your knees as you reach the mat<\/li>\n<li>Walk out into a press up hold position and lower towards the mat<\/li>\n<li>Take your feet wider (either side of the mat) and keep your legs straight<\/li>\n<li>With your hands shoulder-width, bend your elbows to lower your head gently towards the mat (heels will lift as you move). This is working your biceps and chest<\/li>\n<li>Straighten your arms to return to the downward-dog press up start position<\/li>\n<li>Walk your hands in towards your feet and gently roll up to standing, bringing your feet hip-width<\/li>\n<li>Repeat and move your hands closer to form a triangle and bend your elbows to lower your head gently towards the mat, working your triceps<\/li>\n<li>Straighten your arms to return to the start position, walk your hands in and roll up to standing<\/li>\n<li>Aim to build up to repeating five downward-dog press ups in each hand position before returning to standing.<\/li>\n<\/ul>\n<h2>Arm circles and toe taps in table-top<\/h2>\n<ul>\n<li>Lie on the mat with your feet hip-width and knees bent, feet flat on the mat<\/li>\n<li>Breathe out to lift one leg into table-top and then the other. Your knees should ideally be at 90 degrees, above the hips<\/li>\n<li>Gently tap alternate toes onto the mat, keeping the other leg in position. Repeat four times on each leg<\/li>\n<li>Pause and float both arms up towards the ceiling, softening your shoulder blades into the mat<\/li>\n<li>As you tap a foot onto the mat, take both your arms back towards the mat, then sweep the arms out to the side and return to the start position as the foot returns to table-top.<\/li>\n<li>Repeat with the other foot and aim to complete four repetitions on each leg.<\/li>\n<\/ul>\n<h2>Side star in four-point kneeling<\/h2>\n<ul>\n<li>Move into a four-point kneeling position<\/li>\n<li>Shift your weight into your right side and carefully extend your left arm and left leg<\/li>\n<li>Gently rotate into a sideways position, lifting your arm and leg towards ceiling<\/li>\n<li>Carefully lower back to the start position<\/li>\n<li>Repeat on the other side<\/li>\n<li>Aim to hold the star position for 10 seconds on each side, without losing your balance.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Swim England para-swimming trainer Sam Cooper focuses on advanced moves in her fifth supple strength session. This latest workout will introduce and guide you though squat to calf raisers, squat with rotation, downward-dog press ups, arm circles and toe taps in table-top and side-star in four-point kneeling. Participants should be fit enough to undertake exercise &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/supple-strength-advanced-moves\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":77,"featured_media":11194,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[18],"tags":[124,123],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11193"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/77"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=11193"}],"version-history":[{"count":5,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11193\/revisions"}],"predecessor-version":[{"id":11209,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11193\/revisions\/11209"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/11194"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=11193"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=11193"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=11193"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":11201,"date":"2021-03-05T13:53:16","date_gmt":"2021-03-05T13:53:16","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=11201"},"modified":"2021-03-05T13:53:16","modified_gmt":"2021-03-05T13:53:16","slug":"anna-hopkin-change-adaptability","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/anna-hopkin-change-adaptability\/","title":{"rendered":"Anna Hopkin on facing change and importance of adaptability"},"content":{"rendered":"<p><strong>Ahead of her appearance in our Sharing Success Series – where she will be speaking in-depth about her swimming journey – freestyle specialist Anna Hopkin gives some insight into her own career and her advice to youngsters.<\/strong><\/p>\n<p>Anna Hopkin knows all about adaptability.<\/p>\n<p>The 25-year-old Commonwealth Games bronze medallist has had what some would call an unorthodox swimming career – taking a hiatus from the sport in her early teenage years.<\/p>\n<!-- Start content block: supporter-membership-btn -->\n    <style type=\"text\/css\">\n        .btn-container {\r\n    text-align: center;\r\n}\r\n.supporter-btn {\r\n  border: none;\r\n  color: white;\r\n  padding: 15px 32px;\r\n  text-align: center;\r\n  text-decoration: none;\r\n  display: inline-block;\r\n  font-size: 16px;\r\n  cursor: pointer;\r\n  background-color: #4CAF50;\r\n  margin-bottom: 15px;\r\n}\n    <\/style>\n    <div class=\"btn-container\"><a href=\"https:\/\/support.swimming.org\/\" target=\"_blank\"><button class=\"supporter-btn\">Join us and make your voice heard<\/button><\/a><\/div>\n<!-- End content block: supporter-membership-btn -->\n\n<p>Despite time spent out of the water, the now Loughborough National Centre-based athlete has enjoyed many breakout performances across the last number of years and has her sights set on this summer&#8217;s Olympic Games.<\/p>\n<p>Hopkin believes her experiences are relevant to thousands of young club swimmers who have been forced to miss out on taking part in the sport they love while pools have been closed during the coronavirus lockdowns.<\/p>\n<blockquote><p>&#8220;You never forget how to swim. Everyone&#8217;s swimming journey is going to be different but when you&#8217;re young, you&#8217;re so adaptable. I took a really long break and I did other sports and I stayed fit.<\/p><\/blockquote>\n<p>&#8220;Obviously this is probably the longest that any of them will have been out of the water and I&#8217;m sure a lot of them have been doing that throughout this time – doing other sports to stay fit.&#8221;<\/p>\n<h2>Change and adaptability<\/h2>\n<p>Hopkin left the sport at the age of 13 after her love for swimming dwindled and she wanted to explore other sports. Before heading to University four years later, she decided to join a sports team and so a return to the water ensued.<\/p>\n<p>This extended break is reminiscent of what members of the aquatics community are currently facing but her advice is simple.<\/p>\n<p>She said: &#8220;Although you might have lost a bit of feel or fitness, it doesn&#8217;t take as long as you think it will to get back into it.<\/p>\n<p>&#8220;When you&#8217;re young you think you have to be the best you&#8217;re going to be right there and then. Whereas actually, personally I think to have a long swimming career it&#8217;s better to have slow and steady improvements.&#8221;<\/p>\n<p>Her experiences over the last year have also been dominated by change which reinforces her message that being adaptable is paramount in order to be a successful athlete.<\/p>\n<p>Anna was completing a masters degree at The University of Arkansas and was due to graduate last summer, finish her collegiate career, and return to England to swim under Mel Marshall.<\/p>\n<p>However, her plans were cut short due to the pandemic and so her departure from America was brought forward. A year out from Olympic Trials, she changed programme, coach, and country.<\/p>\n<p>Anna will be sharing her story in the fully-booked Sharing Success session alongside European gold medallist Tom Dean on Sunday 7 March.<\/p>\n<p>She said: &#8220;I&#8217;m really excited, I feel quite honoured to be asked to act as a mentor to younger swimmers.<\/p>\n<p>&#8220;I think it will be really exciting to share my experiences and hopefully inspire some of the younger swimmers to take it to the next level.&#8221;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ahead of her appearance in our Sharing Success Series – where she will be speaking in-depth about her swimming journey – freestyle specialist Anna Hopkin gives some insight into her own career and her advice to youngsters. Anna Hopkin knows all about adaptability. The 25-year-old Commonwealth Games bronze medallist has had what some would call &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/anna-hopkin-change-adaptability\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":98,"featured_media":10386,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11201"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/98"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=11201"}],"version-history":[{"count":5,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11201\/revisions"}],"predecessor-version":[{"id":11207,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11201\/revisions\/11207"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/10386"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=11201"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=11201"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=11201"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":11181,"date":"2021-03-03T17:22:18","date_gmt":"2021-03-03T17:22:18","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=11181"},"modified":"2021-03-03T17:40:03","modified_gmt":"2021-03-03T17:40:03","slug":"british-swimming-competition-manchester","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/british-swimming-competition-manchester\/","title":{"rendered":"British Swimming announces additional meet to be held in Manchester"},"content":{"rendered":"<p>British Swimming has announced that the Manchester Aquatics Centre will host a second competition this month following the success of the recent <a href=\"https:\/\/www.swimming.org\/sport\/manchester-international-swim-meet\/\">Manchester International Swim Meet (MISM)<\/a>.<\/p>\n<p>This Invitational Meet will take place from 12-14 March and according to British Swimming, is being put on &#8216;to aid the preparations of those aiming for success at the Olympic and Paralympic Games this summer&#8217;.<\/p>\n<p>Last month&#8217;s competition, which saw the likes of Adam Peaty, James Guy, Ellie Simmonds and Luke Greenbank return to racing on home soil, was held under strict Covid-19 health and safety protocols.<\/p>\n<!-- Start content block: supporter-membership-btn -->\n    <style type=\"text\/css\">\n        .btn-container {\r\n    text-align: center;\r\n}\r\n.supporter-btn {\r\n  border: none;\r\n  color: white;\r\n  padding: 15px 32px;\r\n  text-align: center;\r\n  text-decoration: none;\r\n  display: inline-block;\r\n  font-size: 16px;\r\n  cursor: pointer;\r\n  background-color: #4CAF50;\r\n  margin-bottom: 15px;\r\n}\n    <\/style>\n    <div class=\"btn-container\"><a href=\"https:\/\/support.swimming.org\/\" target=\"_blank\"><button class=\"supporter-btn\">Join us and make your voice heard<\/button><\/a><\/div>\n<!-- End content block: supporter-membership-btn -->\n\n<p>The same protocols &#8211; which were developed in conjunction with the Manchester Safety Advisory Group (SAG), which includes Public Health England &#8211; will apply.<\/p>\n<p>This will mean that anyone involved in the meet will have to provide a negative lateral flow test before entering the &#8216;competition bubble&#8217;. Attendants will also be required to confine themselves to the meet hotel, the Manchester Aquatics Centre and private transport for the duration of the three-day meet.<\/p>\n<p>In addition, face coverings and social distancing will be mandatory at all times, other than when swimmers are in the water. These strict measures resulted in no positive coronavirus cases emerging from February&#8217;s meet.<\/p>\n<h2>&#8216;Vigilant against complacency&#8217;<\/h2>\n<p>However, British Swimming&#8217;s chief executive, Jack Buckner has said: “The Manchester International was a definite triumph – the level of planning and risk mitigation that went into getting the event off the ground, and then running it safely and smoothly, was unbelievable.<\/p>\n<p>&#8220;I am extremely proud of what we managed to achieve thanks to the cooperation of everyone involved, from staff and partners through to athletes, volunteers and officials.<\/p>\n<p>“That being said, we must be extremely vigilant against complacency. Just because we pulled it off once doesn’t mean we can let our guard down. We have tightened a couple of our procedures further still, but it will need the same diligence from everyone to run another successful meet&#8221;, he added.<\/p>\n<p>Councillor Luthfur Rahman OBE, Manchester City Council&#8217;s Executive Member for Skills, Culture and Leisure, said of the competitive activity:<\/p>\n<p>&#8220;We&#8217;re extremely pleased and proud of the successful, safe staging of the Manchester International Swim Meet and stand ready to host this second elite event for the nation&#8217;s top swimmers, with strict COVID protocols in place throughout to protect all participants, officials and volunteers.<\/p>\n<p>&#8220;Working with British Swimming in this way, with the City of Manchester Swim Team playing a big part in making the event happen through their support, is further proof of our commitment to swimming and Team GB&#8217;s preparations for the Tokyo Olympics.&#8221;<\/p>\n<p>The event will be live-streamed via <a href=\"https:\/\/www.youtube.com\/user\/BritishSwimming\">British Swimming&#8217;s YouTube channel.<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>British Swimming has announced that the Manchester Aquatics Centre will host a second competition this month following the success of the recent Manchester International Swim Meet (MISM). This Invitational Meet will take place from 12-14 March and according to British Swimming, is being put on &#8216;to aid the preparations of those aiming for success at &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/british-swimming-competition-manchester\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":98,"featured_media":10741,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11181"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/98"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=11181"}],"version-history":[{"count":6,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11181\/revisions"}],"predecessor-version":[{"id":11187,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11181\/revisions\/11187"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/10741"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=11181"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=11181"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=11181"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":11173,"date":"2021-03-03T12:13:09","date_gmt":"2021-03-03T12:13:09","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=11173"},"modified":"2021-03-03T12:18:57","modified_gmt":"2021-03-03T12:18:57","slug":"events-return-before-season-end","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/events-return-before-season-end\/","title":{"rendered":"Swim England Swimming Leadership &#8216;keen to see&#8217; events return before end of season"},"content":{"rendered":"<p>The Swim England Swimming Leadership Group is ‘keen to see’ formal competition resume before the end of the season.<\/p>\n<p>Following the Prime Minister’s roadmap out of lockdown announcement, the Swimming Leadership Group has been formulating plans for the safe return of licensed and unlicensed meets, open water, Masters, para-swimming and league competition.<\/p>\n<p>Meanwhile, a second series of Level X Racing will run until 23 July when pools reopen from Monday 12 April.<\/p>\n<p>Tom Baster, the chairman of the Swim England Swimming Leadership Group, said: “We know that our aquatic community is looking forward to hearing of our plans for a return to competition.<\/p>\n<!-- Start content block: supporter-membership-btn -->\n    <style type=\"text\/css\">\n        .btn-container {\r\n    text-align: center;\r\n}\r\n.supporter-btn {\r\n  border: none;\r\n  color: white;\r\n  padding: 15px 32px;\r\n  text-align: center;\r\n  text-decoration: none;\r\n  display: inline-block;\r\n  font-size: 16px;\r\n  cursor: pointer;\r\n  background-color: #4CAF50;\r\n  margin-bottom: 15px;\r\n}\n    <\/style>\n    <div class=\"btn-container\"><a href=\"https:\/\/support.swimming.org\/\" target=\"_blank\"><button class=\"supporter-btn\">Join us and make your voice heard<\/button><\/a><\/div>\n<!-- End content block: supporter-membership-btn -->\n\n<p>“Whilst the Government’s roadmap may have been a source of disappointment to some of our members, particularly those over 18, the announcements and provisional dates provide us with the clearest indication in over a year that competition will return before the end of the swimming season.<\/p>\n<p>“The Swimming Leadership Group is keen to ensure that as many people as possible are afforded the opportunity to safely ‘take their marks’ in formal competition as soon as possible, subject to the guidance of their coaches in returning them to racing fitness.<\/p>\n<p>“While we are currently formulating plans for the safe return of the many different levels and types of competitive swimming, we are mindful that social distancing remains in place until 21 June and this may seriously limit a venue’s capacity to hold a swimming competition prior to this date.<\/p>\n<p>“We are currently consulting with a range of partners, including leisure providers, to assess what may be possible whilst social distancing remains in place.<\/p>\n<p>“The Group is committed to sharing information with our members, and plans to release a series of updates covering more detailed plans in the coming weeks.”<\/p>\n<p>Swim England is now finalising a Return to Competition document which will contain advice on holding pool-based events in Covid-19 times.<\/p>\n<h2>Keen to see formal competition recommence<\/h2>\n<p>Tom added: “Unless indicative dates change, from Monday 12 April, under 18 year old swimmers will be able to resume pool-based affiliated club training.<\/p>\n<p>“From this date, Swim England will open a second series of Level X Racing which will run until 23 July 2021.<\/p>\n<p>“The purpose of this is to provide all Category 2 swimmers with the opportunity to engage in racing, even if this is in their training environment.<\/p>\n<p>“For this series of Level X Racing, clubs are encouraged, where they are able, to develop Covid-safe ways of using electronic timing where the venue permits, following the guidance in the soon-to-be published Return to Competition document.<\/p>\n<p>“The Swim England Swimming Leadership Group is aware that some of this equipment will have sat unused for over a year, and it would therefore be prudent for it to be tested in an informal environment before normal galas resume.<\/p>\n<p>“Notwithstanding these recommendations, it is still possible to manually time Level X Racing. Level X Conditions also permit clubs to charge a small entry fee per race – clubs may consider using Level X as a fundraising activity in the short term.<\/p>\n<p>“All racing distances are possible, but 800m and 1500m events should only be considered once coaches consider swimmers to be suitably fit, after at least eight weeks of regular training.<\/p>\n<p>“The Group is keen to see formal competition recommence as soon as possible. We are finalising our plans and will detail these in the near future.”<\/p>\n<p>Meanwhile, the Swim England leadership groups for other disciplines are developing Return to Competition guidance and details will be published in due course.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Swim England Swimming Leadership Group is ‘keen to see’ formal competition resume before the end of the season. Following the Prime Minister’s roadmap out of lockdown announcement, the Swimming Leadership Group has been formulating plans for the safe return of licensed and unlicensed meets, open water, Masters, para-swimming and league competition. Meanwhile, a second &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/events-return-before-season-end\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":77,"featured_media":9493,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11173"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/77"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=11173"}],"version-history":[{"count":5,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11173\/revisions"}],"predecessor-version":[{"id":11178,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/11173\/revisions\/11178"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/9493"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=11173"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=11173"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=11173"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}]